<template>
	<div>
		
		<!-- 头部 -->
	  <top-head
	    @go-back="goBack()"
	    :show_back="true"
	    :show_border="false"
	  >
	    <div slot="left"></div>
	    <div slot="main"></div>
	    <div slot="right"></div>
	  </top-head>
	  <!-- 头部 -->

		<div class="register-wrap">

			<div class="user-register-wrap">
				<div class="top-blank"></div>

				<h4 class="step-title">手机号注册</h4>

				<div class="tip-wrap">
					<p>&nbsp;</p>
				</div>

				<ul class="form-ribbon-wrap">
					<li class="form-ribbon-cell">
						<div class="input-cell">
							<input required ref="phone" class="form-ribbon-input" @click="clickInput('phone')" @blur="inputBlurValidate('phone')" name="phone" type="number" autocomplete="off" v-model="info.phone" placeholder="请输入你的手机号" />
							<span class="clear-input-btn iconfont icon-close2" @click="clearInputValue('phone')"></span>
						</div>
						<div class="error-hint" v-if="!validation.phone">手机号格式不正确</div>
					</li>
					<!-- <li class="form-ribbon-cell">
						<div class="input-cell">
							<input class="form-ribbon-input" @click="clickInput('captcha_image')" @blur="inputBlurValidate('captcha_image')" name="captcha_image" type="text" autocomplete="off" v-model="info.captcha_image" placeholder="请输入图形验证码" />
							<img class="captcha" :src="'data:image/png;base64,'+captcha_image_base64" @click="getCaptchaImage(info.access_token)"/>
						</div>
						<div class="error-hint" v-if="!validation.captcha_image">图形验证码格式不正确</div>
					</li> -->
				</ul>

				<div class="btn-wrap">
					<a href="javascript:;" class="next-btn" :class="{'active':pass_validate}" @click='nextStep'>注册</a>
				</div>

				<div class="contract-wrap">
					<p>注册即表示同意<a class="contract-btn" @click="showRegisterContract">《黄金象用户注册协议》</a></p>
				</div>
			</div>


			<!-- 黄金象用户注册协议 -->
	    <Popup
	        v-model="show_register_contract"
	        position="right" 
	        class="pop-modal">
	      <a href="javascript:void(0);" class="iconfont icon-back" @click="show_register_contract=false"></a>
	      <div class="title">{{ register_contract.title }}</div>
	      <div class="content">
	        <div class="pop-content-wrap">
	        	<pre>
		黄金象平台（以下简称“本网站”）由上海找银网络科技有限公司运营（以下简称 “本公司”）。为通过有效的法律途径切实保障您的合法权益，明确您在本网站使用过程中的权利及义务，本网站将与注册用户之间签署《黄金象服务协议》，并由电子合同的第三方认证和存管机构就认证电子合同的真实、准确、有效及电子合同的后续存管提供专业服务，请您务必仔细阅读以下条款。

本协议将由本公司与您签署，若您对本协议内容无异议，则请点击本协议下方的同意按钮予以确认，进行上述操作将视为您同意本网站通过第三方电子签名认证机构为您申请CA证书，并用于签署本协议及后续具体交易的各项协议。若您不接受以下条款或者无法准确理解本网站对条款的解释，您可以立即停止后续操作，包括但不限于不要接受本协议，不使用本网站服务。

第一条	本协议的签署、修订及组成

1.1	本网站只接受持有中华人民共和国（以下简称“中国”，为本协议之目的，不包括香港特别行政区、澳门特别行政区及中国台湾地区）有效身份证明的18周岁以上具有完全民事行为能力的自然人成为网站用户。如您不符合资格，请勿注册，否则本网站有权随时中止或终止您的用户资格，因此而中止或终止用户资格所导致的任何后果由您个人所承担，本网站不承担任何责任。
1.2	本协议内容包括以下条款及本网站已经发布的或将来可能发布的各类业务协议、各类规则。所有业务协议、规则为本协议不可分割的一部分，与本协议具有同等法律效力。本协议与业务协议约定不一致的，以业务协议约定为准。
1.3	本协议是您与本公司共同签订的，在您完成本网站的实名认证后正式生效，适用于您在本网站的全部活动。在您注册成为用户及进行实名认证时，您已经阅读、理解并接受本协议的全部条款及各类规则，并承诺遵守中国的各类法律规定，如因违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。
1.4	本网站有权根据需要不时地修改本协议或根据本协议制定、修改各类业务协议、具体规则并在本网站相关系统板块发布，但无需另行单独通知您。您应不时地关注本协议、各业务协议及具体规则的变更，若您在本协议、业务协议及具体规则内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用本网站的服务；同时就您在协议和具体规则修订前通过本网站进行的交易及其效力，视为您已同意并已按照协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您应停止使用本网站的服务。
1.5	您通过自行或授权有关方根据本协议及本网站有关规则、说明进行相关操作确认本协议后，本协议即在您和本网站之间产生法律效力。
1.6	正式签署后并带有您电子签名的合同将存储于本网站及第三方认证机构的服务器，您可以通过本网站及对应其他产品的相关板块查阅统一格式的电子合同文本，除经本网站确认您本人确有必要调取带有您本人电子签名之合同的情况外，本网站将不提供带有电子签名的合同文本。

第二条	风险揭示

您作为注册用户使用本网站时，已知悉通过本网站进行相关交易可能存在以下风险，并据此自行判断是否完成实名认证及进行该等交易，该等风险并不能揭示您通过本网站进行交易的全部风险及市场的全部情形，您在做出交易决策前，应全面了解相关交易，谨慎决策，并自行承担全部风险：

2.1	政策风险  由于国家法律、法规、政策的变化，紧急措施的出台，相关监管部门监管措施的实施，交易所交易规则的修改等原因，均可能会对您的交易产生影响，您必须承担由此导致的损失。
2.2	技术风险  本网站所提供的服务系通过电子通讯技术和互联网技术来实现。有关通讯服务及软、硬件服务由不同的供应商提供，可能会存在品质和稳定性方面的风险，通讯或网络故障导致的某些服务中断或延时可能会对您的交易产生影响。另外，您的电脑系统有可能被病毒和/或网络黑客攻击，从而使您的购买决策无法正确和/或及时执行。对于上述不确定因素的出现也存在着一定的风险，有可能会对您的购买产生影响。
2.3	信息风险  本网站对您所进行的交易并不做任何形式的赢利保证，任何因信任本网站提供的讯息而制定决策、作为或不作为，本网站都将不对由此产失的损失承担责任，也不对因提供讯息的滞缓、不精确、错误、或者疏漏所引起的损失负责。
2.4	其他不可抗力风险  本网站提供的服务在遇到战争、台风、水灾、火灾、海啸、雷击、暴动、电信部门技术管制、政府行为、以及停电、技术故障、电子故障等其他无法预测和防范的其他不可抗力事件时，都有可能会对您的交易产生影响或对您造成损失。

第三条	服务的提供

3.1	本网站提供的服务包括但不限于：黄金报价查询、购买储值金条、黄金存储、黄金实物及其制品兑换、黄金回收、珠宝首饰交易、资金充值、提现等，具体详情以本网站当时提供的服务内容为准，且以不违反现有法律、法规、规章和规范性文件的规定为前提。
3.2	基于运行和交易安全的需要，本网站可以暂时停止提供、限制或改变本网站服务的部分功能，或提供新的功能。在任何功能减少、增加或者变化时，只要您仍然使用本网站的服务，表示您仍然同意本协议或者变更后的协议。
3.3	您确认，您在本网站上按本网站服务流程所确认的交易状态将成为本网站为您进行相关交易或操作（包括但不限于冻结资金、代为支付或收取款项、订立合同等）的明确指令。您同意本网站有权按相关指令依据本协议和/或有关文件和规则对相关事项进行处理。
3.4	您未能及时对交易状态进行修改或确认或未能提交相关申请所引起的任何纠纷或损失由您本人负责，本网站不承担任何责任。

第四条	储值金条交易及管理

4.1	在您成功注册并进行实名认证后，您可以根据本网站有关规则和说明，通过本网站购买储值金条和珠宝首饰，详细操作规则及方式请见有关协议及本网站相关页面的规则和说明。
4.2	您对在本网站的个人账户中的储值金条享有所有权，并有权根据本协议和相关业务协议、相关规则对其进行处分。
4.3	您从本网站所购买的储值金条或珠宝首饰，请及时填写邮寄地址，由本网站统一安排寄送。
4.4	您从本网站购买的储值金条，您选择储值金条寄存业务的，将默认由本网站进行寄存服务，在储值金条寄存期间，您同意本网站在不影响您接受本网站所提供的提取储值金条等服务的情况下，授权本网站就所寄存的储值金条进行合理的管理，包括但不限于开展向第三方出借储值金条等业务及其他合法方式的使用，您可根据本网站相关业务协议、规则，获得本网站提供的一定的黄金克重作为使用费用。寄存储值金条的获得的黄金克重，由本网站根据市场行情及风险情况每日做出调整，并通过网站进行公布。
4.5	本网站将保障您在本网站的个人账户中拥有的储值金条的安全性，但为保证寄存业务的管理效率，本网站无需向您告知使用您个人账户下所拥有储值金条的具体方式；您可按网站的具体业务协议、相关规则通过将储值金条提货或者不出库回购的形式，终止您所拥有的本网站下购买的储值金条在本网站的寄存。
4.6	本网站有权根据运营及风险控制的需要，通过在网站上的功能设定、发布公告与通知等形式，规定及调整您在特定时间内购买、回购储值金条等操作的限额。
4.7	您在本网站购买的储值金条，除提取储值金条、交由本网站寄存、由本网站回购外，本网站不接受其他形式的交易的请求。您在购买储值金条后选择提货储值金条或终止寄存后选择提货储值金条时，应提交具体收货地址并支付相应快递费，本网站会指定合作的快递公司进行储值金条的配送。
4.8	您理解储值金条产品的价格波动属性，因此，不同时间点的储值金条价格应以网站的实时金价数据为准。您可以通过提前充值到您在本网站的个人账户来缩短支付过程时间；如果您通过您在本网站的账户余额进行购买支付，本网站将按照您确认支付的时间点核算您所购买的储值金条价格与所购得的储值金条重量。

第五条	储值金条购买

5.1	本网站所销售的实物储值金条产品，可接受您的直接购买，本网站有权根据储值金条产品库存及订单情况，规定在特定时间内可供购买和回购的储值金条产品限额。
5.2	本网站所提供的储值金条产品的纯度、规格、款式等信息详见网站相关产品介绍页面。
5.3	在您购买储值金条产品交易完成后，因原料环节、生产环节、物流环节或其他非本网站主观原因导致您无法按网站声明的规定时间收到储值金条产品的，本网站不承担相关责任。
5.4	本网站所有储值金条产品通过网站规定的方式发送至您的手中，包括但不限于快递、普通邮寄、挂号信等。本网站所有储值金条产品的发送均向保险公司投保，以保障您的财产安全；请您在接收快递时检查包装是否有损坏，并当场拆封，确认是否接收；如遇到产品在发送过程中丢失或掉包的情形，请留存好相关证据，并在第一时间告知本网站客服人员。如本网站收到快递的签收确认，则默认为您已收到所购买的储值金条产品并放弃一切追诉的权利。
5.5	本网站所有储值金条产品一经签收不接受无偿退货，具体请详见本网站的相关退货说明。
5.6	您理解储值金条产品的价格波动属性，因此，不同时间点的储值金条价格应以网站的实时储值金条产品报价为准。

第六条	资金管理

6.1	就您在本网站进行的储值金条产品购买，本网站和/或本网站委托的第三方机构将为您提供“资金管理服务”，主要包括但不限于：资金的充值、提现、代收、代付、查询等。您可以通过本网站有关页面的具体规则或说明详细了解。
6.2	您已知悉，上述资金充值、提现、代收、代付以及查询等服务涉及本网站与第三方支付机构或金融机构的合作，并对下述事项予以认可：
6.2.1受第三方支付机构或金融机构可能仅在工作日进行资金代扣及划转的现状等各种原因所限，本网站不对前述服务的资金到账时间做任何承诺，也不承担与此相关的责任，包括但不限于由此产生的利息、货币贬值等损失；
6.2.2 —经您使用前述服务，即表示您不可撤销地授权本网站进行相关操作，且该等操作是不可逆转的，您不能以任何理由拒绝付款或要求取消交易。就前述服务，您应按照有关文件及第三方支付机构或金融机构的规定支付第三方的费用，您与第三方之间就费用支付事项产生的争议或纠纷，与本网站无关。
6.3	您保证并承诺您用于参与本网站相关交易的资金来源合法且不会受到任何其他方的权利追索。您同意，本公司有权按照包括但不限于公安机关、检察机关、法院等司法机关、行政机关、军事机关的要求协助对您的账户及资金等进行查询、冻结或扣划等操作。
6.4	本网站有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您了解，本网站的前述设定可能会对您的交易造成一定不便，您对此没有异议。
6.5	如果本网站发现了因系统故障或其他原因导致的处理错误，无论有利于本网站还是有利于您，本网站都有权在根据本协议规定通知您后纠正该错误。如果该错误导致您实际收到的金额少于您应获得的金额，则本网站在确认该处理错误后会尽快将您应收金额与实收金额之间的差额存入您的用户账户。如果该错误导致您实际收到的金额多于您应获得的金额，则无论错误的性质和原因为何，您都应及时根据本网站向您发出的有关纠正错误的通知的具体要求返还多收的款项或根据本网站的要求进行相应操作。您理解并同意，您因前述处理错误而多付或少付的款项均不计利息，本网站不承担因前述处理错误而导致的任何损失或责任（包括您可能因前述错误导致的利息、汇率等损失），但因本网站恶意或重大过失而导致的处理错误除外。
6.6	在任何情况下，对于您使用本网站服务过程中涉及由第三方提供相关服务的责任由该第三方承担，本网站不承担该等责任。因您自身的原因导致本网站服务无法提供或提供时发生任何错误而产生的任何损失或责任，由您自行负责，本网站不承担责任。

第七条	电子合同

7.1	在本网站平台交易需订立的协议采用电子合同方式，可以有一份或者多份并且每一份具有同等法律效力，该等合同均采用电子签名并由依法设立的电子认证服务提供者进行认证。您或您的代理人根据有关协议及本网站的相关规则在本网站确认签署的电子合同即视为您本人真实意愿并以您本人名义签署的合同，具有法律效力。您应妥善保管自己的账户密码等账户信息，您通过前述方式订立的电子合同对合同各方具有法律约束力，您不得以账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。
7.2	您根据本协议以及本网站的相关规则签署电子合同后，不得擅自修改该合同。本网站和/或本网站聘请的电子合同存管机构向您提供电子合同的保管查询、核对等服务，如对电子合同真伪或电子合同的内容有任何疑问，您可通过本网站的相关系统板块查阅有关合同并进行核对。如对此有任何争议，应以本网站和/或本网站聘请的电子合同存管机构记录的合同为准。

第八条	用户信息、隐私权保护及账户安全

8.1	用户信息的提供、搜集及核实
8.1.1	您有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性、安全性和及时更新，以便本网站为您提供服务并与您进行及时、有效的联系。您应完全独自承担因通过该等联系方式无法与您取得联系而导致的您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。倘若您提供的资料不真实、准确和完整或本网站有合理理由怀疑该资料不真实、准确,、完整的，本网站有权暂停或终止您的注册身份，并拒绝您在目前和将来对服务以任何形式使用。如因您所提供的资料的不真实、不准确、不完整或不能反映当前情况而给本网站或其他关联方造成损失的，您应承担相应的赔偿责任。
8.1.2	您知悉，本网站可能自公开及其他合法资料来源收集您的其他信息，以更好地了解本网站用户，并为其度身订造本网站服务、解决争议和确保在网站进行交易的安全性。本网站仅收集本网站认为就此目的及达成该目的所必须的关于您的个人资料。
8.1.3	您同意本网站可以自行或通过合作的第三方机构对您提交或本网站搜集的用户信息（包括但不限于您的个人身份证信息等）进行核实，并对获得的核实结果根据本协议及有关文件进行查看、使用和留存等操作。
8.1.4	本网站按照您在本网站上的行为自动追踪关于您的某些资料。本网站利用这些资料进行有关本网站之用户的人口统计、兴趣及行为的内部研究，以更好地了解您以便向您和本网站的其他用户提供更好的服务。
8.1.5	本网站在本网站的某些网页上使用诸如“Cookies”的资料收集装置。“Cookies”是设置在您的硬盘上的小档案，以协助本网站为您提供度身订造的服务。本网站亦提供某些只能通过使用“Cookies”才可得到的功能。本网站还利用“Cookies”使您能够在某段期间内减少输入密码的次数。“Cookies”还可以协助本网站提供专门针对您的兴趣而提供的资料。
8.1.6	如果您将个人通讯信息（例如：手机短信、电邮或信件）交付给本网站，或如果其他用户或第三方向本网站发出关于您在本网站上的活动或登录事项的通讯信息，本网站可以将这些资料收集在您的专门档案中。
8.2	用户信息的使用和披露
8.2.1	您同意本网站可使用关于您的个人资料（包括但不限于本网站持有的有关您的档案中的资料，及本网站从您目前及以前在本网站上的活动所获取的其他资料）以解决争议、对纠纷进行调停、确保在本网站进行安全交易以及其他合法用途，并执行本网站的服务协议及相关规则。本网站有时可能调查多个用户以识别问题或解决争议，特别是本网站可审查您的资料以区分使用多个用户名或别名的用户。为限制在网站上的欺诈或其他非法行为、刑事犯罪活动，避免对本网站及注册用户造成损失，您同意本网站可通过人工或自动程序对您的个人资料进行评价并根据实际需要在本网站的相关板块予以显示。
8.2.2	您同意本网站可以使用您的个人资料以改进本网站的推广和促销工作、分析网站的使用率、改善本网站的内容和产品推广形式，并使本网站的网站内容、设计和服务更能符合用户的要求。
8.2.3	您同意本网站利用您的资料与您联络并（在某些情况下）向您传递针对您的兴趣而提供的信息，该等信息包括但不限于：有针对性的广告条、行政管理方面的通知、产品提供以及有关您使用本网站的通讯。您接受本协议即视为您同意收取这些资料。
8.2.4	本网站对于您提供的、自行收集到的、经认证的个人信息将按照本协议及有关规则予以保护、使用或者披露。本网站将采用行业标准惯例以保护您的个人资料，但鉴于技术限制，本网站不能确保您的全部私人通讯及其他个人资料不被相关方以其他方式获取。
8.2.5	您使用本网站服务进行交易时，您即授权本公司将您的包括但不限于真实姓名、联系方式等必要的个人信息和交易信息披露给与您交易的另一方或本网站的合作机构（仅限于本网站为完成拟向您提供的服务而合作的机构）。
8.2.6	本网站有义务根据有关法律要求向司法机关和政府部门提供您的个人资料。
8.3	在本网站提供的交易活动中，您无权要求本网站提供其他用户的个人资料。
8.4	您须谨慎保管您的用户名、密码等个人信息并定期更换密码，您于本网站注册的账号仅限本人使用，不可转让及赠送。通过您的用户名和密码编辑进行的任何交易或做出的任何行为都将被视为您本人的行为。因您未保管好自己的账号密码等账号信息所产生的任何损失，本网站不承担任何责任。

第九条	不保证及使用限制

9.1	不保证
9.1.1	在任何情况下，本公司及其股东、创建人、高级职员、董事、代理人、关联公司、母公司、子公司和雇员（以下合称“本公司方”）均不以任何明示或默示的方式保证对您使用本网站服务而产生的任何形式的直接或间接损失承担法律责任，包括但不限于资金损失、利润损失、营业中断损失等，无论您通过本网站形成的交易情形是否适用本网站的风险备用金规则或者是否存在第三方担保。同时，受限于本网站所收集的相关信息的多样性，本网站不能完全保证网站内容的真实性、充分性、及时性、完整性和有效性，您同意本网站免除任何由此引起的法律责任。
9.1.2	您同意，本网站不能保证也没有义务保证第三方网站上的信息的真实性、准确性和有效性。您应按照第三方网站的服务协议使用第三方网站，而不是按照本协议。第三方网站的内容、产品、广告和其他任何信息均由您自行判断并承担风险，而与本网站无关。
9.1.3	鉴于技术及设备的局限性，因为本网站或者涉及的第三方网站的设备、系统存在缺陷、被黑客攻击、出现网络故障、电力中断、计算机病毒或其他不可抗力因素造成的损失，本网站不承担相应的赔偿责任，您可以与本网站协商终止本协议并停止使用本网站。但是，中国现行法律、法规另有规定的除外。
9.2	使用限制
9.2.1	您承诺合法使用本网站提供的服务及网站内容。您不得利用本网站从事侵害他人合法权益之行为，不得在本网站从事任何可能违反中国的法律、法规、规章和政府规范性文件的行为或者任何未经授权的行为，如擅自进入本网站的未公开的系统、不正当的使用账号密码和网站的任何内容等。
9.2.2	您不得使用本网站提供的服务或其他电子邮件转发服务发出垃圾邮件或其他可能违反本协议的内容。
9.2.3	本网站没有义务监测网站内容，但是您确认并同意本网站有权不时地根据法律、法规、政府要求透露、修改或者删除必要的信息，以便更好地运营本网站并保护自身及本网站的其他合法用户。
9.2.4	本网站中全部内容的版权均属于本公司所有，该等内容包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片及其他全部信息（以下称“网站内容”）。网站内容受中华人民共和国著作权法及各国际版权公约的保护。未经本网站事先书面同意，您承诺不以任何方式、不以任何形式复制、模仿、传播、出版、公布、展示网站内容，包括但不限于电子的、机械的、复印的、录音录像的方式和形式等。您承认网站内容是属于本网站的财产，未经本公司书面同意，您不得将本网站包含的任何内容镜像到任何其他网站或者服务器。任何未经授权对网站内容的使用均属于违法行为，本公司有权根据法律、法规就本协议的规定追究其责任。
9.2.5	由于您违反本协议或任何法律、法规或侵害第三方的权利，而引起第三方对本公司提出的任何形式的索赔、权利主张或要求、诉讼，本公司有权向您追偿相关的直接损失或间接损失，包括但不限于本公司因此支付的法律服务等中介费用、名誉损失、及向第三方支付的补偿金、损害赔偿金等。

第十条	协议终止及账户的暂停、注销或终止

10.1	除非本网站终止本协议或者您申请终止本协议且经本网站同意，否则本协议始终有效。在您违反了本协议及相关规则，或在相关法律法规、政府部门的要求下，本网站有权通过站内信、电子邮件通知等方式终止本协议、关闭您的账户或者限制您使用本网站。但本网站的终止行为不能免除您根据本协议或在本网站生成的其他协议项下的尚未履行完毕的义务。
10.2	若您发现有第三人冒用或盗用您的用户账户及密码，或具他任何未经合法授权的情形，应立即以有效方式通知本网站，要求本网站暂停相关服务，否则由此产生的一切责任由您本人承担。同时，您理解本网站对您要求暂停服务等处理请求采取行动需要合理期限，在此之前，本网站对第三人使用该服务所导致的损失不承担任何责任。
10.3	您决定不再使用在本网站的用户账户时，应首先清偿所有应付款项（包括但不限于服务费、管理费等），再将用户账户中的可用款项（如有）全部提现或者向本网站发出其它合法的支付指令，并向本网站申请注销该用户账户，经本网站审核同意后可正式注销用户账户。会员死亡或被宣告死亡的，其在本协议项下的各项权利义务由其继承人承担。若会员丧失全部或部分民事权利能力或民事行为能力，本网站有权根据有效法律文书（包括但不限于生效的法院判决等）或其法定监护人的指示处置与用户账户相关的款项。
10.4	您同意，本网站有权基于单方独立判断，在认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向您提供本协议项下的全部或部分会员服务，并将注册资料移除或删除，且无需对您或任何第三方承担任何责任。前述情形包括但不限于：
10.4.1	本网站认为您提供的个人资料不具有真实性、有效性或完整性；
10.4.2	本网站发现异常交易或有交易行为存在疑义或有违法之虞时；
10.4.3	本网站认为您的账户涉嫌洗钱、套现、传销、被冒用或其他本网站认为有风险之情形；
10.4.4	您使用本网站服务的行为涉嫌违反国家法律法规及行政规定的；
10.4.5	本网站基于单方面合理判断认为账户操作、储值金条现货、资金进出等存在异常时；
10.4.6	您受到第三方的投诉，且对方已经提供了一定证据的；
10.4.7	本网站认为您已经违反本协议之内容；
10.4.8	本网站基于交易安全等原因，根据其单独判断需先行暂停、中断或终止向您提供本协议项下的全部或部分会员服务，并将注册资料移除或删除的其他情形。
10.5	您同意，在必要时，本网站无需进行事先通知即有权终止提供用户账户服务，并可能立即暂停、关闭或删除您的用户账户及该用户账户中的所有相关资料及档案，并将您滞留在这些账户的全部合法资金退回到您的银行账户。
10.6	您同意，用户账户的暂停、中断或终止不代表您在本协议项下及本网站相关交易行为中责任和义务的终止，您仍应对您使用本网站服务期间的行为承担可能的违约或损害赔偿责任，同时本网站仍可保有您的相关信息。
10.7	若您使用第三方网站账号注册本网站用户账户，则您应对您在本网站用户账户所对应的第三方网站账号拥有合法的使用权，如您因故对该第三方网站账号丧失使用权的，则本网站有权停止为您的该用户账户提供服务。但如该用户账户尚存有余额的，本网站将会为您妥善保管。此时，如您欲取回该原有余额，本网站将提供更换本网站账户名的服务，即您可把您原本网站账户下余额转移到您另外合法注册的本网站账户中；如因故无法自助完成更换账户名，您可以向本网站提出以银行账户接受原有资金的请求，经核验属实后，本网站可配合您将原有资金转移到以您真实姓名登记的银行账户下。

第十一条	通知

11.1	本协议项下的通知如以公示方式作出，一经在本网站公示即视为已经送达。除此之外，其他向您个人发布的具有专属性的通知将由本网站向您在注册时提供的电子邮箱，或本网站在您的个人账户中为您设置的站内消息系统栏，或您在注册后在本网站绑定的手机发送，一经发送即视为已经送达。请您密切关注您的电子邮箱、站内消息系统栏中的邮件、信息及手机中的短信信息。您同意本网站出于向您提供服务之目的，可以向您的电子邮箱、站内消息系统栏和手机发送有关通知或提醒；若您不愿意接收，请在本网站相应系统板块进行设置。但您同时同意并确认，若您设置了不接收有关通知或提醒，则您有可能无法收到该等通知信息，您不得以您未收到或未阅读该等通知信息主张相关通知未送达于您。

第十二条	适用法律和管辖

12.1	本协议的签署、生效、解释、履行等均受中国法律的管辖。
12.2	因本协议引起的或与本协议有关的任何争议，首先通过友好协商方式予以解决。若协商不成，则您与本公司均有权向本公司所在地有管辖权的法院提起诉讼。

第十三条	其他

13.1	本公司对本协议拥有最终的解释权。
13.2	本协议及本网站有关页面的相关名词可互相引用参照，如有不同理解，则以本协议条款为准。
若本协议的部分条款被认定为无效或者无法履行，本协议中的其他条款仍然有效。
	        	</pre>
	        </div>
	      </div>
	    </Popup>

		</div>
	</div>
</template>



<script>
import topHead from "@/views/components/TopHead.vue";
import constants    from '@/assets/js/constants.js';
import store from '@/vuex/index.js'

import {
	Toast,
	MessageBox,
	Popup,
} from 'mint-ui';

export default {
	components:{
		Popup:Popup,
		topHead:topHead,
	},
	props:["step_view","info","referrer","root_data"],

	data(){
		return {
			validation:{
				phone:true,
				// captcha_image:true,
			},
			// pass_validate:false,
			show_register_contract:false,
			captcha_image_base64:"",
			register_contract:{
				title:"黄金象用户注册协议",
				content:"",
			},
		}
	},
	mounted:function(){
		var me = this;
		utils.storageClear();
		this.getAccessToken(function(){
			// me.getCaptchaImage(me.info.access_token);
		});
		// this.getRegisterContract();
	},
	computed:{
		pass_validate:function(){
			var res = false;
			if(this.validate('phone')){
				res = true;
			}else{
				res = false;
			}

			return res;
		},
	},
	watch:{
	},
	// activated:function(){
	// 	var me = this;
	// 	this.getAccessToken(function(){
	// 		me.getCaptchaImage(me.info.access_token);
	// 	});
	// },
	// filters: {  
	// 	filterPhone: function (val) {  
	// 		return val.replace(/\B(?=(?:\d{4})+$)/g, '-'); 
	// 	}  
	// },
	methods:{
		goBack:function(){
			this.$router.goBack();
		},
		validate:function(key){
			var success = new RegExp(constants.FORM_REG[key],'g').test(_.trim(this.info[key]));
  		return success;
		},
		clickInput:function(key){
			this.validation[key] = true;
		},
		inputBlurValidate:function(key){//表单输入框在blur时验证格式
			return;
			this.validation[key] = this.validate(key);
		},
		clearInputValue:function(key){
			this.info[key] = "";
      this.$refs[key].focus();
      this.validation[key] = true;
		},
		getAccessToken:function(cb){
			var me = this;

			utils.API.access_token({
        data:{}
      })
      .then(function (ret) {
      	me.info.access_token = ret.model.data.access_token;
      	cb&&cb();
      })
      .catch(function(ret){
        !ret.__servererror__ && Toast(ret.errorMessage||"未知错误！");
        // me.root_data.has_send_captcha = false;
      })
		},
		// getCaptchaImage:function(access_token){
		// 	var me = this;

		// 	this.validation.captcha_image = true;

		// 	utils.API.captcha_image({
  //       data:{
  //       	token:access_token,
  //       }
  //     })
  //     .then(function (ret) {
  //     	me.captcha_image_base64 = ret.model.data.base64;
  //     })
  //     .catch(function(ret){
  //       !ret.__servererror__ && Toast(ret.errorMessage||"未知错误！");
  //     })
		// },
		simulateLogin:function(){
			var me = this;

			return new Promise(function(resolve, reject) {
				utils.API.user_signin({
	        data: {
	          type: "password",
	          name: me.info.phone,
	          password:"0",
	        }
	      })
	      .then(function(ret) {
	        // resolve(ret.model);
	        reject(ret)
	      })
	      .catch(function(e) {
	      	// reject(e)
	      	resolve(e);
	        // !e.__servererror__ && Toast(e.errorMessage || "未知错误！");
	      });
			})	
		},
		nextStep:function(){
			var success = true,
					me = this;

			if(!this.pass_validate){
				return;
			}

			_.forOwn(this.validation, function(value, key) {
				var res = me.validate(key);
				me.validation[key] = res;
				if(!res){
					success = false;
				}
 			});

			if(!success){//表单输入格式验证
				return;
			}

			this.simulateLogin()
			.then(function(e){
				if(e.__servererror__){
					return;
				}

				if(e.errorCode == "user_notexist"){//未注册
					// console.log("未注册")
					me.$emit("gotoStep",'2',"left");
				}else if(e.errorCode == "userinfo_error"){//已经注册
					Toast("此手机号已经被注册！")
				}
			})
			.catch(function(ret) {
				// console.log("ret:",ret);
        // !e.__servererror__ && Toast(e.errorMessage || "未知错误！");
      });
		}.after(function(){
      utils.trackEvent('click_signup_nextButton_1');
    }),

		getRegisterContract:function(){
			var me = this;
			// me.protocol_show = true;
			utils.API.protocol_detail({
				data:{
					type: 'register',
				}
			})
			.then(function (ret) {
				me.register_contract = _.assign(me.register_contract,{
					title:ret.model[0].title,
					content:ret.model[0].body,
				});
			})
			.catch(function(ret){
				!ret.__servererror__ && Toast(ret.errorMessage||"未知错误！");
			});
		},
		showRegisterContract:function(){
			this.show_register_contract = true;
		},
	}

};
</script>


<style lang="less" scoped>
@import "./register.less";

</style>